app/controllers/api/pokemon_controller.rb

SELECT "pokemons".* FROM "pokemons"
---
  def index
    @pokemon = Pokemon.all